cf_billing/InformationRegisters/энргСостояниеДопускаВПомещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеДопускаВПомещение</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Недопуск</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеДопускаВПомещение/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ТекстЗапросаПриборыБезДопускаПодрядБольшеОпределенногоЧисла(ИмяТаблицыСПриборами) Экспорт 
		
	Текст  =
		"ВЫБРАТЬ
		|	энргСостояниеДопускаВПомещениеСрезПоследних.Организация КАК Организация,
		|	энргСостояниеДопускаВПомещениеСрезПоследних.Район КАК Район,
		|	энргСостояниеДопускаВПомещениеСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргСостояниеДопускаВПомещениеСрезПоследних.ПриборУчета КАК ПриборУчета,
		|	энргСостояниеДопускаВПомещениеСрезПоследних.Период КАК ДатаПоследнегоНедопуска
		|ПОМЕСТИТЬ ПриборыСНЕдопускомПоСрезу
		|ИЗ
		|	РегистрСведений.энргСостояниеДопускаВПомещение.СрезПоследних(
		|			&Период,
		|			(Организация, Район, КлючПомещения, ПриборУчета) В
		|				(ВЫБРАТЬ
		|					ДанныеДокументов.Организация,
		|					ДанныеДокументов.Район,
		|					ДанныеДокументов.КлючПомещения,
		|					ДанныеДокументов.ПриборУчета
		|				ИЗ
		|					&ИмяТаблицыСПриборами КАК ДанныеДокументов)) КАК энргСостояниеДопускаВПомещениеСрезПоследних
		|ГДЕ
		|	энргСостояниеДопускаВПомещениеСрезПоследних.Недопуск = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргСостояниеДопускаВПомещениеСрезПоследних.Период КАК Период,
		|	энргСостояниеДопускаВПомещениеСрезПоследних.Организация КАК Организация,
		|	энргСостояниеДопускаВПомещениеСрезПоследних.Район КАК Район,
		|	энргСостояниеДопускаВПомещениеСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргСостояниеДопускаВПомещениеСрезПоследних.ПриборУчета КАК ПриборУчета
		|ПОМЕСТИТЬ ДатаПоследнегоДопускаКПриборуНачало
		|ИЗ
		|	РегистрСведений.энргСостояниеДопускаВПомещение.СрезПоследних(
		|			&Период,
		|			(Организация, Район, КлючПомещения, ПриборУчета) В
		|					(ВЫБРАТЬ
		|						ПриборыСНЕдопускомПоСрезу.Организация,
		|						ПриборыСНЕдопускомПоСрезу.Район,
		|						ПриборыСНЕдопускомПоСрезу.КлючПомещения,
		|						ПриборыСНЕдопускомПоСрезу.ПриборУчета
		|					ИЗ
		|						ПриборыСНЕдопускомПоСрезу КАК ПриборыСНЕдопускомПоСрезу)
		|				И Недопуск = 0) КАК энргСостояниеДопускаВПомещениеСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриборыСНЕдопускомПоСрезу.Организация КАК Организация,
		|	ПриборыСНЕдопускомПоСрезу.Район КАК Район,
		|	ПриборыСНЕдопускомПоСрезу.КлючПомещения КАК КлючПомещения,
		|	ПриборыСНЕдопускомПоСрезу.ПриборУчета КАК ПриборУчета,
		|	ПриборыСНЕдопускомПоСрезу.ДатаПоследнегоНедопуска КАК ДатаПоследнегоНедопуска,
		|	ЕСТЬNULL(ДатаПоследнегоДопускаКПриборуНачало.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПоследнегоДопуска
		|ПОМЕСТИТЬ ДатаПоследнегоДопускаКПриборуКонец
		|ИЗ
		|	ПриборыСНЕдопускомПоСрезу КАК ПриборыСНЕдопускомПоСрезу
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДатаПоследнегоДопускаКПриборуНачало КАК ДатаПоследнегоДопускаКПриборуНачало
		|		ПО ПриборыСНЕдопускомПоСрезу.Организация = ДатаПоследнегоДопускаКПриборуНачало.Организация
		|			И ПриборыСНЕдопускомПоСрезу.Район = ДатаПоследнегоДопускаКПриборуНачало.Район
		|			И ПриборыСНЕдопускомПоСрезу.КлючПомещения = ДатаПоследнегоДопускаКПриборуНачало.КлючПомещения
		|			И ПриборыСНЕдопускомПоСрезу.ПриборУчета = ДатаПоследнегоДопускаКПриборуНачало.ПриборУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДатаПоследнегоДопускаКПриборуКонец.Организация КАК Организация,
		|	ДатаПоследнегоДопускаКПриборуКонец.Район КАК Район,
		|	ДатаПоследнегоДопускаКПриборуКонец.КлючПомещения КАК КлючПомещения,
		|	ДатаПоследнегоДопускаКПриборуКонец.ПриборУчета КАК ПриборУчета,
		|	СУММА(энргСостояниеДопускаВПомещение.Недопуск) КАК Недопуск
		|ПОМЕСТИТЬ ПриборыСНЕДопуском
		|ИЗ
		|	ДатаПоследнегоДопускаКПриборуКонец КАК ДатаПоследнегоДопускаКПриборуКонец
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеДопускаВПомещение КАК энргСостояниеДопускаВПомещение
		|		ПО ДатаПоследнегоДопускаКПриборуКонец.Организация = энргСостояниеДопускаВПомещение.Организация
		|			И ДатаПоследнегоДопускаКПриборуКонец.Район = энргСостояниеДопускаВПомещение.Район
		|			И ДатаПоследнегоДопускаКПриборуКонец.КлючПомещения = энргСостояниеДопускаВПомещение.КлючПомещения
		|			И ДатаПоследнегоДопускаКПриборуКонец.ПриборУчета = энргСостояниеДопускаВПомещение.ПриборУчета
		|			И (энргСостояниеДопускаВПомещение.Период МЕЖДУ ДатаПоследнегоДопускаКПриборуКонец.ДатаПоследнегоДопуска И ДатаПоследнегоДопускаКПриборуКонец.ДатаПоследнегоНедопуска)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДатаПоследнегоДопускаКПриборуКонец.Организация,
		|	ДатаПоследнегоДопускаКПриборуКонец.Район,		
		|	ДатаПоследнегоДопускаКПриборуКонец.КлючПомещения,
		|	ДатаПоследнегоДопускаКПриборуКонец.ПриборУчета
		|
		|ИМЕЮЩИЕ
		|	СУММА(энргСостояниеДопускаВПомещение.Недопуск) >= &КолвоНедопусковПодряд
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";
	
	Текст = СтрЗаменить(Текст, "&ИмяТаблицыСПриборами", ИмяТаблицыСПриборами);
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
